{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": [],
      "collapsed_sections": [
        "9_0oQo-APS7f",
        "le_Pfi0pPVjj",
        "EG8yJzIFbQf3"
      ]
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "# 용어 정리\n",
        "\n",
        "## 추천 시스템의 종류\n",
        "- 아이템(콘텐츠) 기반 추천 시스템 (Item-based)\n",
        "    - 사용자가 좋아하는 아이템과 유사한 아이템을 추천하는 방식\n",
        "    - ex) \"토이스토리와 비슷한 장르의 영화를 추천해주세요\"\n",
        "    - ex) \"인셉션 감독의 다른 영화를 추천해주세요\"\n",
        "\n",
        "- 사용자 기반 추천 시스템 (User-based)\n",
        "    - 특정 아이템을 좋아하는 사용자가 좋아하는 또 다른 아이템을 추천하는 방식\n",
        "    - ex) \"토이스토리를 좋아하는 사람들이 공통적으로 좋아하는 영화를 추천해주세요\"\n",
        "\n",
        "## Gradio\n",
        "- 머신러닝 모델 등을 웹 앱 형태로 빠르게 배포할 수 있는 파이썬 라이브러리\n",
        "- 쉽고 간편한 UI 구성이 특징"
      ],
      "metadata": {
        "id": "K2ZXgpPKFj8P"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "## 0. 환경 설정"
      ],
      "metadata": {
        "id": "13RfDLhyPNkX"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "!pip install neo4j-graphrag neo4j openai"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "collapsed": true,
        "id": "Db2sh3701xu-",
        "outputId": "eb5592d3-cdf4-4beb-a9f6-51100122fc5b"
      },
      "execution_count": 1,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Collecting neo4j-graphrag\n",
            "  Downloading neo4j_graphrag-1.12.0-py3-none-any.whl.metadata (19 kB)\n",
            "Collecting neo4j\n",
            "  Downloading neo4j-6.1.0-py3-none-any.whl.metadata (5.3 kB)\n",
            "Requirement already satisfied: openai in /usr/local/lib/python3.12/dist-packages (2.16.0)\n",
            "Collecting fsspec<2025.0.0,>=2024.9.0 (from neo4j-graphrag)\n",
            "  Downloading fsspec-2024.12.0-py3-none-any.whl.metadata (11 kB)\n",
            "Collecting json-repair<0.45.0,>=0.44.1 (from neo4j-graphrag)\n",
            "  Downloading json_repair-0.44.1-py3-none-any.whl.metadata (12 kB)\n",
            "Requirement already satisfied: numpy<3.0.0,>=2.0.0 in /usr/local/lib/python3.12/dist-packages (from neo4j-graphrag) (2.0.2)\n",
            "Requirement already satisfied: pydantic<3.0.0,>=2.6.3 in /usr/local/lib/python3.12/dist-packages (from neo4j-graphrag) (2.12.3)\n",
            "Collecting pypdf<7.0.0,>=6.0.0 (from neo4j-graphrag)\n",
            "  Downloading pypdf-6.6.2-py3-none-any.whl.metadata (7.1 kB)\n",
            "Requirement already satisfied: pyyaml<7.0.0,>=6.0.2 in /usr/local/lib/python3.12/dist-packages (from neo4j-graphrag) (6.0.3)\n",
            "Requirement already satisfied: scipy<2.0.0,>=1.13.0 in /usr/local/lib/python3.12/dist-packages (from neo4j-graphrag) (1.16.3)\n",
            "Requirement already satisfied: tenacity<10.0.0,>=9.1.2 in /usr/local/lib/python3.12/dist-packages (from neo4j-graphrag) (9.1.2)\n",
            "Collecting types-pyyaml<7.0.0,>=6.0.12.20240917 (from neo4j-graphrag)\n",
            "  Downloading types_pyyaml-6.0.12.20250915-py3-none-any.whl.metadata (1.7 kB)\n",
            "Requirement already satisfied: pytz in /usr/local/lib/python3.12/dist-packages (from neo4j) (2025.2)\n",
            "Requirement already satisfied: anyio<5,>=3.5.0 in /usr/local/lib/python3.12/dist-packages (from openai) (4.12.1)\n",
            "Requirement already satisfied: distro<2,>=1.7.0 in /usr/local/lib/python3.12/dist-packages (from openai) (1.9.0)\n",
            "Requirement already satisfied: httpx<1,>=0.23.0 in /usr/local/lib/python3.12/dist-packages (from openai) (0.28.1)\n",
            "Requirement already satisfied: jiter<1,>=0.10.0 in /usr/local/lib/python3.12/dist-packages (from openai) (0.12.0)\n",
            "Requirement already satisfied: sniffio in /usr/local/lib/python3.12/dist-packages (from openai) (1.3.1)\n",
            "Requirement already satisfied: tqdm>4 in /usr/local/lib/python3.12/dist-packages (from openai) (4.67.1)\n",
            "Requirement already satisfied: typing-extensions<5,>=4.11 in /usr/local/lib/python3.12/dist-packages (from openai) (4.15.0)\n",
            "Requirement already satisfied: idna>=2.8 in /usr/local/lib/python3.12/dist-packages (from anyio<5,>=3.5.0->openai) (3.11)\n",
            "Requirement already satisfied: certifi in /usr/local/lib/python3.12/dist-packages (from httpx<1,>=0.23.0->openai) (2026.1.4)\n",
            "Requirement already satisfied: httpcore==1.* in /usr/local/lib/python3.12/dist-packages (from httpx<1,>=0.23.0->openai) (1.0.9)\n",
            "Requirement already satisfied: h11>=0.16 in /usr/local/lib/python3.12/dist-packages (from httpcore==1.*->httpx<1,>=0.23.0->openai) (0.16.0)\n",
            "Requirement already satisfied: annotated-types>=0.6.0 in /usr/local/lib/python3.12/dist-packages (from pydantic<3.0.0,>=2.6.3->neo4j-graphrag) (0.7.0)\n",
            "Requirement already satisfied: pydantic-core==2.41.4 in /usr/local/lib/python3.12/dist-packages (from pydantic<3.0.0,>=2.6.3->neo4j-graphrag) (2.41.4)\n",
            "Requirement already satisfied: typing-inspection>=0.4.2 in /usr/local/lib/python3.12/dist-packages (from pydantic<3.0.0,>=2.6.3->neo4j-graphrag) (0.4.2)\n",
            "Downloading neo4j_graphrag-1.12.0-py3-none-any.whl (207 kB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m208.0/208.0 kB\u001b[0m \u001b[31m3.0 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hDownloading neo4j-6.1.0-py3-none-any.whl (325 kB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m325.3/325.3 kB\u001b[0m \u001b[31m13.1 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hDownloading fsspec-2024.12.0-py3-none-any.whl (183 kB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m183.9/183.9 kB\u001b[0m \u001b[31m7.8 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hDownloading json_repair-0.44.1-py3-none-any.whl (22 kB)\n",
            "Downloading pypdf-6.6.2-py3-none-any.whl (329 kB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m329.1/329.1 kB\u001b[0m \u001b[31m14.1 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hDownloading types_pyyaml-6.0.12.20250915-py3-none-any.whl (20 kB)\n",
            "Installing collected packages: types-pyyaml, pypdf, neo4j, json-repair, fsspec, neo4j-graphrag\n",
            "  Attempting uninstall: fsspec\n",
            "    Found existing installation: fsspec 2025.3.0\n",
            "    Uninstalling fsspec-2025.3.0:\n",
            "      Successfully uninstalled fsspec-2025.3.0\n",
            "\u001b[31mERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.\n",
            "gcsfs 2025.3.0 requires fsspec==2025.3.0, but you have fsspec 2024.12.0 which is incompatible.\u001b[0m\u001b[31m\n",
            "\u001b[0mSuccessfully installed fsspec-2024.12.0 json-repair-0.44.1 neo4j-6.1.0 neo4j-graphrag-1.12.0 pypdf-6.6.2 types-pyyaml-6.0.12.20250915\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "API 로그인 > API Key 생성 : https://openai.com/chatgpt/"
      ],
      "metadata": {
        "id": "MKW-bdgH18WC"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "import os\n",
        "os.environ[\"OPENAI_API_KEY\"] = \"\""
      ],
      "metadata": {
        "id": "mxVWhyMb2A1s"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "## 1. GraphDB 불러오기"
      ],
      "metadata": {
        "id": "9_0oQo-APS7f"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Neo4j Sandbox : https://sandbox.neo4j.com/"
      ],
      "metadata": {
        "id": "T2MzCTpQ2Ihk"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "### 1-1. Neo4j 드라이버 설정"
      ],
      "metadata": {
        "id": "le_Pfi0pPVjj"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "from neo4j import GraphDatabase, basic_auth\n",
        "import openai\n",
        "\n",
        "driver = GraphDatabase.driver(\n",
        "    os.getenv(\"NEO4J_URI\"),\n",
        "    auth=basic_auth(\n",
        "        os.getenv(\"NEO4J_USER\"),\n",
        "        os.getenv(\"NEO4J_PASSWORD\")\n",
        "    )\n",
        ")"
      ],
      "metadata": {
        "id": "L4-lQYnlFWAP"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "```cypher\n",
        "MATCH (m:Movie {title:$movie})<-[:RATED]-(u:User)-[:RATED]->(rec:Movie)\n",
        "RETURN distinct rec.title AS recommendation LIMIT 20\n",
        "```\n",
        "\n",
        "- `(m:Movie {title:$movie})` : title이 $movie 인 노드\n",
        "- `(rec:Movie)` : 이 노드는 rec이라는 변수로 지정\n",
        "- `RETURN distinct rec.title` : rec 변수에 있는 노드의 title을 RETURN\n",
        "\n"
      ],
      "metadata": {
        "id": "-eQDxOSx2XSh"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher_query = '''\n",
        "MATCH (m:Movie {title:$movie})<-[:RATED]-(u:User)-[:RATED]->(rec:Movie)\n",
        "RETURN distinct rec.title AS recommendation LIMIT 20\n",
        "'''\n",
        "\n",
        "with driver.session(database=\"neo4j\") as session:\n",
        "  results = session.execute_read(\n",
        "    lambda tx: tx.run(cypher_query,\n",
        "                      movie=\"Crimson Tide\").data())\n",
        "  for record in results:\n",
        "    print(record['recommendation'])\n",
        "\n",
        "#driver.close()"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "mTI3Q6qe00rw",
        "outputId": "ee622fb9-bd29-43df-8a47-65a04c7c8de3"
      },
      "execution_count": 8,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Mr. Holland's Opus\n",
            "Apollo 13\n",
            "Dead Man Walking\n",
            "Seven (a.k.a. Se7en)\n",
            "Heat\n",
            "Get Shorty\n",
            "Fugitive, The\n",
            "Dave\n",
            "Addams Family Values\n",
            "True Lies\n",
            "Speed\n",
            "Lion King, The\n",
            "Four Weddings and a Funeral\n",
            "Forrest Gump\n",
            "Star Trek: Generations\n",
            "Shawshank Redemption, The\n",
            "Stargate\n",
            "Pulp Fiction\n",
            "Outbreak\n",
            "Miracle on 34th Street\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## 2. GRAPH RAG 구현하기"
      ],
      "metadata": {
        "id": "VyJZDdoOkSOB"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Text2Cypher Retriever로 만든 그래프 쿼리 결과 기반 RAG 방식"
      ],
      "metadata": {
        "id": "rum-Lhg1iDCC"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "from neo4j_graphrag.retrievers import Text2CypherRetriever\n",
        "from neo4j_graphrag.llm import OpenAILLM\n",
        "\n",
        "# 쿼리텍스트를 기반으로 Cypher 쿼리문을 생성하고, Retrieval 후 답변을 생성할 때 사용할 LLM\n",
        "llm = OpenAILLM(model_name=\"gpt-4o\", model_params={\"temperature\": 0})"
      ],
      "metadata": {
        "id": "pQhJOnzmaHl4"
      },
      "execution_count": 9,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "### 1) Text2Cypher Retriever"
      ],
      "metadata": {
        "id": "3atYFUn5aiSN"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Cypher 자동생성을 위해 필요한 정보 제공\n",
        "- Neo4j DB Schema\n",
        "- Input / Output(Query) 예시"
      ],
      "metadata": {
        "id": "Lo9sTGD8aW8k"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "#### Neo4j DB Schema\n",
        "\n",
        "```\n",
        "Node properties:\n",
        "Person {name: STRING, born: INTEGER}\n",
        "Movie {tagline: STRING, title: STRING, released: INTEGER}\n",
        "Relationship properties:\n",
        "ACTED_IN {roles: LIST}\n",
        "REVIEWED {summary: STRING, rating: INTEGER}\n",
        "The relationships:\n",
        "(:Person)-[:ACTED_IN]->(:Movie)\n",
        "(:Person)-[:DIRECTED]->(:Movie)\n",
        "(:Person)-[:PRODUCED]->(:Movie)\n",
        "(:Person)-[:WROTE]->(:Movie)\n",
        "(:Person)-[:FOLLOWS]->(:Person)\n",
        "(:Person)-[:REVIEWED]->(:Movie)\n",
        "```"
      ],
      "metadata": {
        "id": "EG8yJzIFbQf3"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "from neo4j import GraphDatabase\n",
        "from neo4j.time import Date\n",
        "\n",
        "def get_node_datatype(value):\n",
        "    \"\"\"\n",
        "        입력된 노드 Value의 데이터 타입을 반환하는 함수\n",
        "    \"\"\"\n",
        "    if isinstance(value, str):\n",
        "        return \"STRING\"\n",
        "    elif isinstance(value, int):\n",
        "        return \"INTEGER\"\n",
        "    elif isinstance(value, float):\n",
        "        return \"FLOAT\"\n",
        "    elif isinstance(value, bool):\n",
        "        return \"BOOLEAN\"\n",
        "    elif isinstance(value, list):\n",
        "        return f\"LIST[{get_node_datatype(value[0])}]\" if value else \"LIST\"\n",
        "    elif isinstance(value, Date):\n",
        "        return \"DATE\"\n",
        "    else:\n",
        "        return \"UNKNOWN\"\n",
        "\n",
        "def get_schema(uri, user, password):\n",
        "    \"\"\"\n",
        "        Graph DB의 정보를 받아 노드 및 관계의 프로퍼티를 추출하고 스키마 딕셔너리를 반환하는 함수\n",
        "    \"\"\"\n",
        "    driver = GraphDatabase.driver(\n",
        "        uri,\n",
        "        auth=basic_auth(user, password))\n",
        "\n",
        "    with driver.session() as session:\n",
        "        # 노드 프로퍼티 및 타입 추출\n",
        "        node_query = \"\"\"\n",
        "        MATCH (n)\n",
        "        WITH DISTINCT labels(n) AS node_labels, keys(n) AS property_keys, n\n",
        "        UNWIND node_labels AS label\n",
        "        UNWIND property_keys AS key\n",
        "        RETURN label, key, n[key] AS sample_value\n",
        "        \"\"\"\n",
        "        nodes = session.run(node_query)\n",
        "\n",
        "        # 관계 프로퍼티 및 타입 추출\n",
        "        rel_query = \"\"\"\n",
        "        MATCH ()-[r]->()\n",
        "        WITH DISTINCT type(r) AS rel_type, keys(r) AS property_keys, r\n",
        "        UNWIND property_keys AS key\n",
        "        RETURN rel_type, key, r[key] AS sample_value\n",
        "        \"\"\"\n",
        "        relationships = session.run(rel_query)\n",
        "\n",
        "        # 관계 유형 및 방향 추출\n",
        "        rel_direction_query = \"\"\"\n",
        "        MATCH (a)-[r]->(b)\n",
        "        RETURN DISTINCT labels(a) AS start_label, type(r) AS rel_type, labels(b) AS end_label\n",
        "        ORDER BY start_label, rel_type, end_label\n",
        "        \"\"\"\n",
        "        rel_directions = session.run(rel_direction_query)\n",
        "\n",
        "        # 스키마 딕셔너리 생성\n",
        "        schema = {\"nodes\": {}, \"relationships\": {}, \"relations\": []}\n",
        "\n",
        "        for record in nodes:\n",
        "            label = record[\"label\"]\n",
        "            key = record[\"key\"]\n",
        "            sample_value = record[\"sample_value\"] # 데이터 타입을 추론하기 위한 샘플 데이터\n",
        "            inferred_type = get_node_datatype(sample_value)\n",
        "            if label not in schema[\"nodes\"]:\n",
        "                schema[\"nodes\"][label] = {}\n",
        "            schema[\"nodes\"][label][key] = inferred_type\n",
        "\n",
        "        for record in relationships:\n",
        "            rel_type = record[\"rel_type\"]\n",
        "            key = record[\"key\"]\n",
        "            sample_value = record[\"sample_value\"] # 데이터 타입을 추론하기 위한 샘플 데이터\n",
        "            inferred_type = get_node_datatype(sample_value)\n",
        "            if rel_type not in schema[\"relationships\"]:\n",
        "                schema[\"relationships\"][rel_type] = {}\n",
        "            schema[\"relationships\"][rel_type][key] = inferred_type\n",
        "\n",
        "        for record in rel_directions:\n",
        "            start_label = record[\"start_label\"][0]\n",
        "            rel_type = record[\"rel_type\"]\n",
        "            end_label = record[\"end_label\"][0]\n",
        "            schema[\"relations\"].append(f\"(:{start_label})-[:{rel_type}]->(:{end_label})\")\n",
        "\n",
        "        return schema\n",
        "\n",
        "def format_schema(schema):\n",
        "    \"\"\"\n",
        "        스키마 딕셔너리를 LLM에 제공하기 위해 원하는 형태로 formatting 하는 함수\n",
        "    \"\"\"\n",
        "    result = []\n",
        "\n",
        "    # 노드 프로퍼티 출력\n",
        "    result.append(\"Node properties:\")\n",
        "    for label, properties in schema[\"nodes\"].items():\n",
        "        props = \", \".join(f\"{k}: {v}\" for k, v in properties.items())\n",
        "        result.append(f\"{label} {{{props}}}\")\n",
        "\n",
        "    # 관계 프로퍼티 출력\n",
        "    result.append(\"Relationship properties:\")\n",
        "    for rel_type, properties in schema[\"relationships\"].items():\n",
        "        props = \", \".join(f\"{k}: {v}\" for k, v in properties.items())\n",
        "        result.append(f\"{rel_type} {{{props}}}\")\n",
        "\n",
        "    # 관계 프로퍼티 출력\n",
        "    result.append(\"The relationships:\")\n",
        "    for relation in schema[\"relations\"]:\n",
        "        result.append(relation)\n",
        "\n",
        "    return \"\\n\".join(result)"
      ],
      "metadata": {
        "id": "7K4dX-ZjglEJ"
      },
      "execution_count": 10,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# Neo4j DB Schema 제공\n",
        "\n",
        "schema = get_schema(\"NEO4J_URI\", \"NEO4J_USER\", \"NEO4J_PASSWORD\")\n",
        "neo4j_schema = format_schema(schema)\n",
        "print(neo4j_schema)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "bR0vMbi5m_KE",
        "outputId": "5d903de9-b62c-4e15-9a7d-39dbbb824494"
      },
      "execution_count": 11,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Node properties:\n",
            "Movie {url: STRING, runtime: INTEGER, revenue: INTEGER, budget: INTEGER, plotEmbedding: LIST[FLOAT], imdbRating: FLOAT, released: STRING, countries: LIST[STRING], languages: LIST[STRING], plot: STRING, imdbVotes: INTEGER, imdbId: STRING, year: INTEGER, poster: STRING, movieId: STRING, tmdbId: STRING, title: STRING}\n",
            "Genre {name: STRING}\n",
            "User {userId: STRING, name: STRING}\n",
            "Actor {bornIn: STRING, born: DATE, died: DATE, tmdbId: STRING, imdbId: STRING, name: STRING, url: STRING, bio: STRING, poster: STRING}\n",
            "Person {bornIn: STRING, born: DATE, died: DATE, tmdbId: STRING, imdbId: STRING, name: STRING, url: STRING, bio: STRING, poster: STRING}\n",
            "Director {url: STRING, bornIn: STRING, bio: STRING, died: DATE, born: DATE, imdbId: STRING, name: STRING, poster: STRING, tmdbId: STRING}\n",
            "Relationship properties:\n",
            "RATED {rating: FLOAT, timestamp: INTEGER}\n",
            "ACTED_IN {role: STRING}\n",
            "DIRECTED {role: STRING}\n",
            "The relationships:\n",
            "(:Actor)-[:ACTED_IN]->(:Movie)\n",
            "(:Actor)-[:DIRECTED]->(:Movie)\n",
            "(:Actor)-[:ACTED_IN]->(:Movie)\n",
            "(:Director)-[:DIRECTED]->(:Movie)\n",
            "(:Movie)-[:IN_GENRE]->(:Genre)\n",
            "(:User)-[:RATED]->(:Movie)\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "#### Retriever 예시 작성"
      ],
      "metadata": {
        "id": "HnuWxzesFR-r"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "- 사용자 입력 : Which actors starred in the Toy Story? (Toy Story 영화에 어떤 배우들이 출연하였나요?)\n",
        "\n",
        "- 자동 생성 Cypher 예시 : `MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.title = 'Toy Story' RETURN a.name`"
      ],
      "metadata": {
        "id": "06C3lVZrthfd"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "※ 추천시스템을 위한 예시 추가\n",
        "\n",
        "※ 사용자의 한국어 질문에 맞춰 예시 수정\n",
        "\n"
      ],
      "metadata": {
        "id": "1FP4BiFAFhJh"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# LLM INPUT / QUERY 예시 제공\n",
        "examples = [\n",
        "    \"USER INPUT: 'Toy Story에 어떤 배우들이 출연하나요?' QUERY: MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.title = 'Toy Story' RETURN a.name\",\n",
        "    \"USER INPUT: 'Toy Story의 평균 평점은 몇점인가요?' QUERY: MATCH (u:User)-[r:RATED]->(m:Movie) WHERE m.title = 'Toy Story' RETURN AVG(r.rating)\",\n",
        "\n",
        "    \"\"\"USER INPUT: '저는 Toy Story 영화를 좋아합니다. Toy Story를 재밌게 본 사람은 또 어떤 영화를 재밌게 봤나요?'\n",
        "    QUERY: MATCH (m:Movie)<-[r:RATED]-(u:User)-[recr:RATED]->(userBasedRec:Movie)\n",
        "    WHERE m.title = 'Toy Story' AND r.rating >= 4 AND recr.rating >= 4\n",
        "    WITH userBasedRec, COUNT(recr) AS recCount, AVG(recr.rating) AS avgRating\n",
        "    ORDER BY avgRating DESC, recCount DESC\n",
        "    RETURN DISTINCT userBasedRec.title, avgRating, recCount\n",
        "    LIMIT 10\n",
        "    \"\"\",\n",
        "\n",
        "    \"\"\"USER INPUT: '저는 'Wizard of Oz, The' 와 같은 영화를 좋아합니다. 이 영화와 비슷한 영화 추천해줄 수 있나요?',\n",
        "    QUERY: MATCH (m:Movie) WHERE m.title = 'Wizard of Oz, The'\n",
        "    MATCH (m)-[:IN_GENRE]->(g:Genre)<-[:IN_GENRE]-(rec:Movie)\n",
        "    WITH m, rec, count(*) AS gs\n",
        "\n",
        "    OPTIONAL MATCH (m)<-[:ACTED_IN]-(a)-[:ACTED_IN]->(rec)\n",
        "    WITH m, rec, gs, count(a) AS as\n",
        "\n",
        "    OPTIONAL MATCH (m)<-[:DIRECTED]-(d)-[:DIRECTED]->(rec)\n",
        "    WITH m, rec, gs, as, count(d) AS ds\n",
        "\n",
        "    RETURN rec.title AS recommendation,\n",
        "            rec.poster AS rec_poster,\n",
        "            gs AS genre_similarity,\n",
        "            as AS actor_similarity,\n",
        "            ds AS director_similarity,\n",
        "           (5*gs)+(3*as)+(4*ds) AS score\n",
        "    ORDER BY score DESC LIMIT 10\n",
        "    \"\"\",\n",
        "\n",
        "    \"\"\"USER INPUT: '영화 'Inception'과 비슷한 장르 혹은 비슷한 분위기의 영화를 추천해주세요.'\n",
        "    QUERY: MATCH (m:Movie)-[:IN_GENRE]->(g:Genre)<-[:IN_GENRE]-(rec:Movie)\n",
        "    WHERE m.title = 'Inception' WITH rec, collect(g.name) AS genres, count(*) AS commonGenres\n",
        "    RETURN rec.title, genres, commonGenres ORDER BY commonGenres DESC LIMIT 10;\"\"\"\n",
        "]"
      ],
      "metadata": {
        "id": "e_iS83oBLi-z"
      },
      "execution_count": 12,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# Text2CypherRetriever\n",
        "retriever = Text2CypherRetriever(\n",
        "    driver=driver,\n",
        "    llm=llm,  # type: ignore\n",
        "    neo4j_schema=neo4j_schema,\n",
        "    examples=examples,\n",
        ")\n",
        "\n",
        "# LLM을 통해 Cypher 쿼리를 생성하여 Neo4j DB에 보내고, 그 결과를 반환 => 이 결과는 RAG에 활용됨\n",
        "query_text = \"Tom Hanks 가 어떤 영화에 출연했나요?\"\n",
        "search_result = retriever.search(query_text=query_text)"
      ],
      "metadata": {
        "id": "kfYUemK4ag8i"
      },
      "execution_count": 13,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "search_result.items"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "WqDmIWU7xKKY",
        "outputId": "f95efad5-921a-4254-d256-cfb6f63867bc"
      },
      "execution_count": 14,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[RetrieverResultItem(content=\"<Record m.title='Punchline'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Catch Me If You Can'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Dragnet'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Saving Mr. Banks'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Bachelor Party'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Volunteers'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Man with One Red Shoe, The'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Splash'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Big'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Nothing in Common'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Money Pit, The'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Toy Story of Terror'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Captain Phillips'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Larry Crowne'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Cloud Atlas'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Angels & Demons'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Extremely Loud and Incredibly Close'>\", metadata=None),\n",
              " RetrieverResultItem(content='<Record m.title=\"Charlie Wilson\\'s War\">', metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Toy Story 3'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='From the Earth to the Moon'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Green Mile, The'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Saving Private Ryan'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Toy Story 2'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Apollo 13'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Toy Story'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='League of Their Own, A'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Forrest Gump'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Philadelphia'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Sleepless in Seattle'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Turner & Hooch'>\", metadata=None),\n",
              " RetrieverResultItem(content='<Record m.title=\"\\'burbs, The\">', metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Joe Versus the Volcano'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Bonfire of the Vanities'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Terminal, The'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Da Vinci Code, The'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Polar Express, The'>\", metadata=None),\n",
              " RetrieverResultItem(content=\"<Record m.title='Ladykillers, The'>\", metadata=None),\n",
              " RetrieverResultItem(content='<Record m.title=\"You\\'ve Got Mail\">', metadata=None)]"
            ]
          },
          "metadata": {},
          "execution_count": 14
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "query_text = \"저는 Titanic을 좋아합니다. 비슷한 영화를 추천해줄 수 있나요?\"\n",
        "search_result = retriever.search(query_text=query_text)"
      ],
      "metadata": {
        "id": "hL1ynoUPgd7m"
      },
      "execution_count": 15,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "search_result.metadata['cypher']"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 122
        },
        "id": "Bnl3Pbxqw5lH",
        "outputId": "5ae5a85b-1817-4d87-a5ed-acbabf88cc1f"
      },
      "execution_count": 16,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "\"MATCH (m:Movie) WHERE m.title = 'Titanic'\\nMATCH (m)-[:IN_GENRE]->(g:Genre)<-[:IN_GENRE]-(rec:Movie)\\nWITH m, rec, count(*) AS gs\\n\\nOPTIONAL MATCH (m)<-[:ACTED_IN]-(a)-[:ACTED_IN]->(rec)\\nWITH m, rec, gs, count(a) AS as\\n\\nOPTIONAL MATCH (m)<-[:DIRECTED]-(d)-[:DIRECTED]->(rec)\\nWITH m, rec, gs, as, count(d) AS ds\\n\\nRETURN rec.title AS recommendation,\\n       rec.poster AS rec_poster,\\n       gs AS genre_similarity,\\n       as AS actor_similarity,\\n       ds AS director_similarity,\\n       (5*gs)+(3*as)+(4*ds) AS score\\nORDER BY score DESC LIMIT 10\""
            ],
            "application/vnd.google.colaboratory.intrinsic+json": {
              "type": "string"
            }
          },
          "metadata": {},
          "execution_count": 16
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "print(search_result.metadata['cypher'])"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "HdzKF9EHdYVI",
        "outputId": "d88f26b2-ac1d-412d-fe2a-88e33253f7e3"
      },
      "execution_count": 17,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "MATCH (m:Movie) WHERE m.title = 'Titanic'\n",
            "MATCH (m)-[:IN_GENRE]->(g:Genre)<-[:IN_GENRE]-(rec:Movie)\n",
            "WITH m, rec, count(*) AS gs\n",
            "\n",
            "OPTIONAL MATCH (m)<-[:ACTED_IN]-(a)-[:ACTED_IN]->(rec)\n",
            "WITH m, rec, gs, count(a) AS as\n",
            "\n",
            "OPTIONAL MATCH (m)<-[:DIRECTED]-(d)-[:DIRECTED]->(rec)\n",
            "WITH m, rec, gs, as, count(d) AS ds\n",
            "\n",
            "RETURN rec.title AS recommendation,\n",
            "       rec.poster AS rec_poster,\n",
            "       gs AS genre_similarity,\n",
            "       as AS actor_similarity,\n",
            "       ds AS director_similarity,\n",
            "       (5*gs)+(3*as)+(4*ds) AS score\n",
            "ORDER BY score DESC LIMIT 10\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "### 2) Retriever 기반 RAG 생성"
      ],
      "metadata": {
        "id": "R-7ysjaRanj2"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "from neo4j_graphrag.generation import GraphRAG\n",
        "# RAG 파이프라인 초기화\n",
        "rag = GraphRAG(retriever=retriever, llm=llm)"
      ],
      "metadata": {
        "id": "bTNvnFnXbKLS"
      },
      "execution_count": 18,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "답변에 사용한 Context 정보를 함께 확인 :\n",
        "https://github.com/neo4j/neo4j-graphrag-python/blob/89411ca2c9ae7fdce63ee9678fe658b2e2ec30dd/src/neo4j_graphrag/generation/graphrag.py#L101"
      ],
      "metadata": {
        "id": "G5nKfQJpyRMk"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# 질문하기\n",
        "query_text = \"Titanic과 비슷한 장르의 영화 추천해주세용.\"\n",
        "\n",
        "response = rag.search(query_text=query_text, return_context = True)\n",
        "print(\"==== [Text2Cypher 를 통해 자동생성한 Cypher] ====\")\n",
        "print(response.retriever_result.metadata['cypher'])\n",
        "print(\"\\n==== [생성된 Cypher를 기반으로 최종답변생성] ====\")\n",
        "print(response.answer)"
      ],
      "metadata": {
        "id": "lG4yrSYoLqt6",
        "collapsed": true,
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "5774e536-d0ec-4006-cffc-240bb78fc5b9"
      },
      "execution_count": 19,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "==== [Text2Cypher 를 통해 자동생성한 Cypher] ====\n",
            "MATCH (m:Movie)-[:IN_GENRE]->(g:Genre)<-[:IN_GENRE]-(rec:Movie) \n",
            "WHERE m.title = 'Titanic' \n",
            "WITH rec, collect(g.name) AS genres, count(*) AS commonGenres \n",
            "RETURN rec.title, genres, commonGenres \n",
            "ORDER BY commonGenres DESC \n",
            "LIMIT 10;\n",
            "\n",
            "==== [생성된 Cypher를 기반으로 최종답변생성] ====\n",
            "'Titanic'과 비슷한 장르의 영화로는 다음과 같은 작품들이 있습니다:\n",
            "\n",
            "1. Dirty Mary Crazy Larry\n",
            "2. Shiri (Swiri)\n",
            "3. Absolute Giganten\n",
            "4. Eight Below\n",
            "5. Kingdom of Heaven\n",
            "6. Helen of Troy\n",
            "7. Robin Hood\n",
            "8. Legend of the Red Dragon (a.k.a. New Legend of Shaolin, The) (Hong Xi Guan: Zhi Shao Lin wu zu)\n",
            "9. Casanova\n",
            "10. House of Flying Daggers (Shi mian mai fu)\n",
            "\n",
            "이 영화들은 모두 드라마, 로맨스, 액션 장르를 포함하고 있습니다.\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# 질문하기\n",
        "query_text = \"Toy Story와 The Godfather 영화를 좋아하는 사람은 또 어떤 영화를 좋아하나요?\"\n",
        "\n",
        "response = rag.search(query_text=query_text, return_context = True)\n",
        "print(\"==== [Text2Cypher 를 통해 자동생성한 Cypher] ====\")\n",
        "print(response.retriever_result.metadata['cypher'])\n",
        "print(\"\\n==== [생성된 Cypher를 기반으로 최종답변생성] ====\")\n",
        "print(response.answer)"
      ],
      "metadata": {
        "id": "WZU21VJjxWjT",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "50c21c68-c178-44ff-f957-b2291a0a2968"
      },
      "execution_count": 20,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "==== [Text2Cypher 를 통해 자동생성한 Cypher] ====\n",
            "MATCH (m1:Movie)<-[r1:RATED]-(u:User)-[r2:RATED]->(rec:Movie), (m2:Movie)<-[r3:RATED]-(u)\n",
            "WHERE m1.title = 'Toy Story' AND m2.title = 'The Godfather' AND r1.rating >= 4 AND r3.rating >= 4 AND r2.rating >= 4\n",
            "WITH rec, COUNT(r2) AS recCount, AVG(r2.rating) AS avgRating\n",
            "ORDER BY avgRating DESC, recCount DESC\n",
            "RETURN DISTINCT rec.title, avgRating, recCount\n",
            "LIMIT 10\n",
            "\n",
            "==== [생성된 Cypher를 기반으로 최종답변생성] ====\n",
            "Toy Story와 The Godfather 영화를 좋아하는 사람은 다양한 장르의 영화를 즐길 가능성이 높습니다. Toy Story는 애니메이션과 가족 영화로, The Godfather는 범죄 드라마로 각각 다른 매력을 가지고 있습니다. 따라서 이 두 영화를 좋아하는 사람은 Pixar의 다른 애니메이션 영화들, 예를 들어 \"Finding Nemo\"나 \"Up\" 같은 작품을 좋아할 수 있으며, 동시에 \"Goodfellas\"나 \"The Shawshank Redemption\" 같은 클래식 범죄 드라마나 드라마 영화도 즐길 수 있을 것입니다. 또한, 다양한 장르의 영화를 수용할 수 있는 취향을 가졌을 가능성이 높아, 코미디, 액션, 스릴러 등 다양한 장르의 영화도 선호할 수 있습니다.\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## 3. Gradio 로 챗봇 배포하기"
      ],
      "metadata": {
        "id": "Id_rgPh8Nwhp"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "!pip install gradio"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "collapsed": true,
        "id": "DKzKkI37JyQW",
        "outputId": "ab1328fc-ee81-4c49-dd0c-f0cae42f7ad9"
      },
      "execution_count": 21,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Requirement already satisfied: gradio in /usr/local/lib/python3.12/dist-packages (5.50.0)\n",
            "Requirement already satisfied: aiofiles<25.0,>=22.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (24.1.0)\n",
            "Requirement already satisfied: anyio<5.0,>=3.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (4.12.1)\n",
            "Requirement already satisfied: brotli>=1.1.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (1.2.0)\n",
            "Requirement already satisfied: fastapi<1.0,>=0.115.2 in /usr/local/lib/python3.12/dist-packages (from gradio) (0.123.10)\n",
            "Requirement already satisfied: ffmpy in /usr/local/lib/python3.12/dist-packages (from gradio) (1.0.0)\n",
            "Requirement already satisfied: gradio-client==1.14.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (1.14.0)\n",
            "Requirement already satisfied: groovy~=0.1 in /usr/local/lib/python3.12/dist-packages (from gradio) (0.1.2)\n",
            "Requirement already satisfied: httpx<1.0,>=0.24.1 in /usr/local/lib/python3.12/dist-packages (from gradio) (0.28.1)\n",
            "Requirement already satisfied: huggingface-hub<2.0,>=0.33.5 in /usr/local/lib/python3.12/dist-packages (from gradio) (1.3.4)\n",
            "Requirement already satisfied: jinja2<4.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (3.1.6)\n",
            "Requirement already satisfied: markupsafe<4.0,>=2.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (3.0.3)\n",
            "Requirement already satisfied: numpy<3.0,>=1.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (2.0.2)\n",
            "Requirement already satisfied: orjson~=3.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (3.11.5)\n",
            "Requirement already satisfied: packaging in /usr/local/lib/python3.12/dist-packages (from gradio) (25.0)\n",
            "Requirement already satisfied: pandas<3.0,>=1.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (2.2.2)\n",
            "Requirement already satisfied: pillow<12.0,>=8.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (11.3.0)\n",
            "Requirement already satisfied: pydantic<=2.12.3,>=2.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (2.12.3)\n",
            "Requirement already satisfied: pydub in /usr/local/lib/python3.12/dist-packages (from gradio) (0.25.1)\n",
            "Requirement already satisfied: python-multipart>=0.0.18 in /usr/local/lib/python3.12/dist-packages (from gradio) (0.0.22)\n",
            "Requirement already satisfied: pyyaml<7.0,>=5.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (6.0.3)\n",
            "Requirement already satisfied: ruff>=0.9.3 in /usr/local/lib/python3.12/dist-packages (from gradio) (0.14.14)\n",
            "Requirement already satisfied: safehttpx<0.2.0,>=0.1.6 in /usr/local/lib/python3.12/dist-packages (from gradio) (0.1.7)\n",
            "Requirement already satisfied: semantic-version~=2.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (2.10.0)\n",
            "Requirement already satisfied: starlette<1.0,>=0.40.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (0.50.0)\n",
            "Requirement already satisfied: tomlkit<0.14.0,>=0.12.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (0.13.3)\n",
            "Requirement already satisfied: typer<1.0,>=0.12 in /usr/local/lib/python3.12/dist-packages (from gradio) (0.21.1)\n",
            "Requirement already satisfied: typing-extensions~=4.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (4.15.0)\n",
            "Requirement already satisfied: uvicorn>=0.14.0 in /usr/local/lib/python3.12/dist-packages (from gradio) (0.40.0)\n",
            "Requirement already satisfied: fsspec in /usr/local/lib/python3.12/dist-packages (from gradio-client==1.14.0->gradio) (2024.12.0)\n",
            "Requirement already satisfied: websockets<16.0,>=13.0 in /usr/local/lib/python3.12/dist-packages (from gradio-client==1.14.0->gradio) (15.0.1)\n",
            "Requirement already satisfied: idna>=2.8 in /usr/local/lib/python3.12/dist-packages (from anyio<5.0,>=3.0->gradio) (3.11)\n",
            "Requirement already satisfied: annotated-doc>=0.0.2 in /usr/local/lib/python3.12/dist-packages (from fastapi<1.0,>=0.115.2->gradio) (0.0.4)\n",
            "Requirement already satisfied: certifi in /usr/local/lib/python3.12/dist-packages (from httpx<1.0,>=0.24.1->gradio) (2026.1.4)\n",
            "Requirement already satisfied: httpcore==1.* in /usr/local/lib/python3.12/dist-packages (from httpx<1.0,>=0.24.1->gradio) (1.0.9)\n",
            "Requirement already satisfied: h11>=0.16 in /usr/local/lib/python3.12/dist-packages (from httpcore==1.*->httpx<1.0,>=0.24.1->gradio) (0.16.0)\n",
            "Requirement already satisfied: filelock in /usr/local/lib/python3.12/dist-packages (from huggingface-hub<2.0,>=0.33.5->gradio) (3.20.3)\n",
            "Requirement already satisfied: hf-xet<2.0.0,>=1.2.0 in /usr/local/lib/python3.12/dist-packages (from huggingface-hub<2.0,>=0.33.5->gradio) (1.2.0)\n",
            "Requirement already satisfied: shellingham in /usr/local/lib/python3.12/dist-packages (from huggingface-hub<2.0,>=0.33.5->gradio) (1.5.4)\n",
            "Requirement already satisfied: tqdm>=4.42.1 in /usr/local/lib/python3.12/dist-packages (from huggingface-hub<2.0,>=0.33.5->gradio) (4.67.1)\n",
            "Requirement already satisfied: typer-slim in /usr/local/lib/python3.12/dist-packages (from huggingface-hub<2.0,>=0.33.5->gradio) (0.21.1)\n",
            "Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.12/dist-packages (from pandas<3.0,>=1.0->gradio) (2.9.0.post0)\n",
            "Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.12/dist-packages (from pandas<3.0,>=1.0->gradio) (2025.2)\n",
            "Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.12/dist-packages (from pandas<3.0,>=1.0->gradio) (2025.3)\n",
            "Requirement already satisfied: annotated-types>=0.6.0 in /usr/local/lib/python3.12/dist-packages (from pydantic<=2.12.3,>=2.0->gradio) (0.7.0)\n",
            "Requirement already satisfied: pydantic-core==2.41.4 in /usr/local/lib/python3.12/dist-packages (from pydantic<=2.12.3,>=2.0->gradio) (2.41.4)\n",
            "Requirement already satisfied: typing-inspection>=0.4.2 in /usr/local/lib/python3.12/dist-packages (from pydantic<=2.12.3,>=2.0->gradio) (0.4.2)\n",
            "Requirement already satisfied: click>=8.0.0 in /usr/local/lib/python3.12/dist-packages (from typer<1.0,>=0.12->gradio) (8.3.1)\n",
            "Requirement already satisfied: rich>=10.11.0 in /usr/local/lib/python3.12/dist-packages (from typer<1.0,>=0.12->gradio) (13.9.4)\n",
            "Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.12/dist-packages (from python-dateutil>=2.8.2->pandas<3.0,>=1.0->gradio) (1.17.0)\n",
            "Requirement already satisfied: markdown-it-py>=2.2.0 in /usr/local/lib/python3.12/dist-packages (from rich>=10.11.0->typer<1.0,>=0.12->gradio) (4.0.0)\n",
            "Requirement already satisfied: pygments<3.0.0,>=2.13.0 in /usr/local/lib/python3.12/dist-packages (from rich>=10.11.0->typer<1.0,>=0.12->gradio) (2.19.2)\n",
            "Requirement already satisfied: mdurl~=0.1 in /usr/local/lib/python3.12/dist-packages (from markdown-it-py>=2.2.0->rich>=10.11.0->typer<1.0,>=0.12->gradio) (0.1.2)\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "import gradio as gr\n",
        "from gradio.themes.base import Base\n",
        "\n",
        "class Seafoam(Base):\n",
        "    pass\n",
        "seafoam = Seafoam()\n",
        "\n",
        "with gr.Blocks(theme=seafoam) as demo: #'JohnSmith9982/small_and_pretty'\n",
        "    def default_llm(message):\n",
        "        prompt_text = f\"\"\"\n",
        "        당신은 영화 추천 시스템을 탑재한 챗봇입니다. user_input 에 대답하되, 사용자에게 좋아하는 영화나 장르 등을 말해보라고 권고해보세요.\n",
        "        user_input : {message}\n",
        "        \"\"\"\n",
        "        return llm.invoke(prompt_text).content\n",
        "\n",
        "    def intent_detection(message):\n",
        "        prompt_text = f\"\"\"\n",
        "        주어진 query_text 가 영화 추천을 받기 위한 본격적인 질문으로 보이면 True를 반환하고, 그렇지 않으면 False를 반환해주세요.\n",
        "        예시 : [(\"query_text\": \"안녕 반가워\", \"answer\": \"False\"), (\"query_text\": \"네가 영화추천을 그렇게 잘한다며?\", \"answer\": \"False\"), (\"query_text\": \"Titanic 영화와 비슷한 장르의 영화를 추천해줄래?\", \"answer\": \"True\")]\n",
        "        query_text : {message}\n",
        "        \"\"\"\n",
        "        return llm.invoke(prompt_text).content == 'True'\n",
        "\n",
        "    def response(message, chat_history):\n",
        "        #### INTENT DETECTION ####\n",
        "        if(intent_detection(message)):\n",
        "            #### ANSWER ####\n",
        "            rag_result = rag.search(query_text=message\n",
        "                                    + \"(Please also provide evidence for how you used context in your answer. YOU MUST ANSWER in KOREAN PLEASE.)\"\n",
        "                                    , return_context = True)\n",
        "            chat_history.append((message, rag_result.answer))\n",
        "            return chat_history, rag_result.retriever_result.metadata['cypher'], rag_result.retriever_result.items\n",
        "        else:\n",
        "            llm_result = default_llm(message)\n",
        "            chat_history.append((message, llm_result))\n",
        "            return chat_history, \"영화 관련 질문이 아니었어요.\", \"영화 관련 질문이 아니었어요.\"\n",
        "\n",
        "    with gr.Row():\n",
        "        with gr.Column(scale=4):\n",
        "            gr.HTML(\"\"\"<div style=\"text-align: center; max-width: 1000px; margin: 10px auto;\">\n",
        "                <div>\n",
        "                    <h1>Graph RAG 챗봇 !</h1>\n",
        "                </div>\n",
        "                <p style=\"margin-bottom: 10px; font-size: 95%\">\n",
        "                    💭 Graph DB의 영화 리뷰 데이터셋을 기반으로 답변합니다. 답변에 사용한 DB 조회 결과를 함께 확인해보세요. </a>\n",
        "                </p>\n",
        "            </div>\"\"\")\n",
        "\n",
        "\n",
        "    with gr.Row():\n",
        "        with gr.Column(scale = 1):\n",
        "            generated_query = gr.Textbox(label=\"생성된 Cypher 쿼리\")\n",
        "            query_result = gr.Textbox(label=\"쿼리 조회 결과\")\n",
        "        with gr.Column(scale = 3):\n",
        "            chatbot = gr.Chatbot()\n",
        "            msg = gr.Textbox(placeholder=\"어떤 영화를 추천받고 싶으신가요? (원하는 장르나 재밌게 봤던 영화를 함께 말하면 도움이 됩니다.)\", label=\"입력\")\n",
        "            examples = gr.Examples(\n",
        "                examples=[\n",
        "                    \"저는 'Net, The' 와 같은 영화를 좋아합니다. 이 영화와 비슷한 영화 추천해줄 수 있나요?\",\n",
        "                    \"영화 'Inception'과 비슷한 장르 혹은 비슷한 분위기의 영화를 추천해주세요.\"\n",
        "                ],\n",
        "                inputs=[msg],\n",
        "            )\n",
        "            with gr.Row():\n",
        "                gr.HTML(\"\"\"<div style=\"text-align: center; max-width: 500px; margin: 0px auto;\">\n",
        "                    <div>\n",
        "                        <h1>  </h1>\n",
        "                    </p>\n",
        "                </div>\"\"\")\n",
        "                gr.HTML(\"\"\"<div style=\"text-align: center; max-width: 500px; margin: 0px auto;\">\n",
        "                    <div>\n",
        "                        <h1>  </h1>\n",
        "                    </p>\n",
        "                </div>\"\"\")\n",
        "                btn = gr.Button(\"Submit\", variant=\"primary\")\n",
        "                clear = gr.Button(\"Clear\")\n",
        "\n",
        "    btn.click(fn=response, inputs=[msg, chatbot], outputs=[chatbot, generated_query, query_result])\n",
        "    msg.submit(response, [msg, chatbot], [chatbot, generated_query, query_result])\n",
        "\n",
        "    clear.click(lambda: None, None, msg, queue=False)\n",
        "\n",
        "demo.launch(debug=True, share=True)#debug=True, share=True"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 750
        },
        "id": "chGxy2Bvjcpb",
        "outputId": "86de1b42-7d30-406d-a3e9-8145b6a5551e"
      },
      "execution_count": 22,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "/tmp/ipython-input-4204533397.py:8: DeprecationWarning: The 'theme' parameter in the Blocks constructor will be removed in Gradio 6.0. You will need to pass 'theme' to Blocks.launch() instead.\n",
            "  with gr.Blocks(theme=seafoam) as demo: #'JohnSmith9982/small_and_pretty'\n",
            "/tmp/ipython-input-4204533397.py:55: UserWarning: You have not specified a value for the `type` parameter. Defaulting to the 'tuples' format for chatbot messages, but this is deprecated and will be removed in a future version of Gradio. Please set type='messages' instead, which uses openai-style dictionaries with 'role' and 'content' keys.\n",
            "  chatbot = gr.Chatbot()\n",
            "/tmp/ipython-input-4204533397.py:55: DeprecationWarning: The default value of 'allow_tags' in gr.Chatbot will be changed from False to True in Gradio 6.0. You will need to explicitly set allow_tags=False if you want to disable tags in your chatbot.\n",
            "  chatbot = gr.Chatbot()\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Colab notebook detected. This cell will run indefinitely so that you can see errors and logs. To turn off, set debug=False in launch().\n",
            "* Running on public URL: https://c14fdae54e450acc5f.gradio.live\n",
            "\n",
            "This share link expires in 1 week. For free permanent hosting and GPU upgrades, run `gradio deploy` from the terminal in the working directory to deploy to Hugging Face Spaces (https://huggingface.co/spaces)\n"
          ]
        },
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "<IPython.core.display.HTML object>"
            ],
            "text/html": [
              "<div><iframe src=\"https://c14fdae54e450acc5f.gradio.live\" width=\"100%\" height=\"500\" allow=\"autoplay; camera; microphone; clipboard-read; clipboard-write;\" frameborder=\"0\" allowfullscreen></iframe></div>"
            ]
          },
          "metadata": {}
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Keyboard interruption in main thread... closing server.\n",
            "Killing tunnel 127.0.0.1:7860 <> https://c14fdae54e450acc5f.gradio.live\n"
          ]
        },
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": []
          },
          "metadata": {},
          "execution_count": 22
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [],
      "metadata": {
        "id": "SZ_L9HWxT4tZ"
      },
      "execution_count": null,
      "outputs": []
    }
  ]
}